[{"movieId":808,"imgPath":"\/2l5UHZBcp9cx1PwKLdisJ0gV9jB.jpg","title":"Shrek","release_date":"2001-05-18","overview":"It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey."},{"movieId":809,"imgPath":"\/l45UqyARB3WxpYNuACjMjndpe85.jpg","title":"Shrek 2","release_date":"2004-05-19","overview":"Shrek, Fiona and Donkey set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and the King find it hard to get along, and there's tension in the marriage. The fairy godmother discovers that Shrek has married Fiona instead of her Son Prince Charming and sets about destroying their marriage."},{"movieId":10192,"imgPath":"\/xZ2we4gdiwQmg6D1w9qHlAm5yIf.jpg","title":"Shrek Forever After","release_date":"2010-05-16","overview":"A bored and domesticated Shrek pacts with deal-maker Rumpelstiltskin to get back to feeling like a real ogre again, but when he's duped and sent to a twisted version of Far Far Away—where Rumpelstiltskin is king, ogres are hunted, and he and Fiona have never met—he sets out to restore his world and reclaim his true love."},{"movieId":11470,"imgPath":"\/7VcvquJfSXpyAb2ajkepR0eHLNF.jpg","title":"Jason X","release_date":"2001-07-24","overview":"In the year 2455, Old Earth is now a contaminated planet abandoned for centuries -- a brown world of violent storms, toxic landmasses and poisonous seas. Yet humans have returned to the deadly place that they once fled, not to live, but to research the ancient, rusting artifacts of the long-gone civilizations. But it's not the harmful environment that could prove fatal to the intrepid, young explorers who have just landed on Old Earth. For them, it's Friday the 13th, and Jason lives!"},{"movieId":57214,"imgPath":"\/mEDMV7gA36wJYYx2VcywF2DWCg1.jpg","title":"Project X","release_date":"2012-03-01","overview":"Three high school seniors throw a party to make a name for themselves. As the night progresses, things spiral out of control as word of the party spreads."},{"movieId":246655,"imgPath":"\/pCssRYbILVduCYDgrcRG0T8W4FN.jpg","title":"X-Men: Apocalypse","release_date":"2016-05-18","overview":"After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan."},{"movieId":73,"imgPath":"\/o4Thn9ooTZAZOYrlbWgVB20weSf.jpg","title":"American History X","release_date":"1998-07-01","overview":"Derek Vineyard is paroled after serving 3 years in prison for killing two African-American men. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did."},{"movieId":438590,"imgPath":"\/l1nYo0yzKjf84atnBDbx0do16vQ.jpg","title":"A-X-L","release_date":"2018-08-23","overview":"The life of a teenage boy is forever altered by a chance encounter with cutting edge military technology."},{"movieId":244506,"imgPath":"\/uD6KIIHoAa6PBXwEdZ7Etinlz0O.jpg","title":"Camp X-Ray","release_date":"2014-10-17","overview":"A young woman joins the military to be part of something bigger than herself and her small-town roots. Instead, she ends up as a new guard at Guantanamo Bay, where her mission is far from black and white. Surrounded by hostile jihadists and aggressive squadmates, she strikes up an unusual friendship with one of the detainees."},{"movieId":808,"imgPath":"\/2l5UHZBcp9cx1PwKLdisJ0gV9jB.jpg","title":"Shrek","release_date":"2001-05-18","overview":"It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey."}]