[{"movieId":239459,"imgPath":null,"title":"No Half Measures: Creating the Final Season of Breaking Bad","genres":["Documentary"],"release_date":"2013-11-26","overview":"A documentary about the making of season five of the acclaimed AMC series Breaking Bad."},{"movieId":559969,"imgPath":"\/9igMXvlUR1zrahnQdiXAg3dtaTb.jpg","title":"El Camino: A Breaking Bad Movie","genres":["Crime","Drama","Thriller","Action"],"release_date":"2019-10-11","overview":"In the wake of his dramatic escape from captivity, Jesse Pinkman must come to terms with his past in order to forge some kind of future."},{"movieId":808,"imgPath":"\/2l5UHZBcp9cx1PwKLdisJ0gV9jB.jpg","title":"Shrek","genres":["Animation","Comedy","Fantasy","Adventure","Family"],"release_date":"2001-05-18","overview":"It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey."},{"movieId":809,"imgPath":"\/l45UqyARB3WxpYNuACjMjndpe85.jpg","title":"Shrek 2","genres":["Animation","Family","Comedy","Fantasy","Adventure"],"release_date":"2004-05-19","overview":"Shrek, Fiona and Donkey set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and the King find it hard to get along, and there's tension in the marriage. The fairy godmother discovers that Shrek has married Fiona instead of her Son Prince Charming and sets about destroying their marriage."},{"movieId":381696,"imgPath":"\/zWDZckQzoHEE4oipgVNWXIFpXCH.jpg","title":"Shrek the Musical","genres":["Music","Comedy","Fantasy"],"release_date":"2013-09-17","overview":"Shrek The Musical is a musical with music by Jeanine Tesori and book and lyrics by David Lindsay-Abaire. It is based on the 2001 DreamWorks Animation's film Shrek and William Steig's 1990 book Shrek! It was nominated for 8 Tony Awards including Best Musical."},{"movieId":252634,"imgPath":"\/rzRthZa34uJUmnmvnepxxBSaRw0.jpg","title":"Shrek Stories","genres":["Family"],"release_date":"2013-10-01","overview":"Join Shrek and his friends from Far Far Away as they share tales of holiday cheer, spooky stories, a singing showdown and a night of babysitting nobody will soon forget."},{"movieId":421892,"imgPath":"\/qTQBFEc3GnPJNVs9uoaBSMwiVbq.jpg","title":"Shrek 5","genres":["Animation","Family","Comedy","Fantasy"],"overview":"Plot unknown. A soft-reboot of the animated \"Shrek\" franchise."},{"movieId":13394,"imgPath":"\/vO1VJevJIKIXGfveYHsLPn8iHUn.jpg","title":"Shrek the Halls","genres":["Adventure","Animation","Comedy","Fantasy","Family"],"release_date":"2007-11-28","overview":"The Christmas tree isn't the only thing green in this new holiday classic. Shrek is back and trying to get into the spirit of the season. After promising Fiona and the kids a Christmas they'll remember, he is forced to take a crash course in the holiday. But just when he thinks he has everything for their quiet family Christmas just right, there is a knock at the door."},{"movieId":810,"imgPath":"\/lxbKrBo1wZ2U9BS1jiZyNe3qI4J.jpg","title":"Shrek the Third","genres":["Fantasy","Adventure","Animation","Comedy","Family"],"release_date":"2007-05-17","overview":"The King of Far Far Away has died and Shrek and Fiona are to become King & Queen. However, Shrek wants to return to his cozy swamp and live in peace and quiet, so when he finds out there is another heir to the throne, they set off to bring him back to rule the kingdom."},{"movieId":10192,"imgPath":"\/xZ2we4gdiwQmg6D1w9qHlAm5yIf.jpg","title":"Shrek Forever After","genres":["Comedy","Adventure","Fantasy","Animation","Family"],"release_date":"2010-05-16","overview":"A bored and domesticated Shrek pacts with deal-maker Rumpelstiltskin to get back to feeling like a real ogre again, but when he's duped and sent to a twisted version of Far Far Away—where Rumpelstiltskin is king, ogres are hunted, and he and Fiona have never met—he sets out to restore his world and reclaim his true love."},{"movieId":286488,"imgPath":"\/xWZqP9Q0dOYnRMpj6qNcnfOC9hu.jpg","title":"Dreamworks Holiday Classics (Merry Madagascar \/ Shrek the Halls \/ Gift of the Night Fury)","genres":["Family","Animation","Comedy"],"release_date":"2012-10-30","overview":"Join your favourite DreamWorks friends for these four holiday specials. Watch as those zany zoosters from Madagascar save Christmas, Donkey puts on a carolling Christmas Shrek-tacular, and Po prepares for his favourite holiday, the Winter Feast."},{"movieId":575506,"imgPath":null,"title":"Creating a Fairy Tale World: The Making of Shrek","genres":["Documentary","TV Movie"],"release_date":"2001-04-22","overview":"Behind-the-scenes look at the making of the DreamWorks Pictures animated feature, \"Shrek.\""},{"movieId":48466,"imgPath":"\/9QXx4tS65s3oUBoQ27bMIwmBD9x.jpg","title":"Scared Shrekless","genres":["Animation","Comedy"],"release_date":"2010-10-28","overview":"Shrek challenges Donkey, Puss in Boots and his other fairy tale character friends to spend the night in Lord Farquaad's haunted castle, telling scary stories to see who can resist becoming scared and stay the longest."},{"movieId":51256,"imgPath":"\/3GaNNflbidNujnTB9aCZw96vZib.jpg","title":"Donkey's Christmas Shrektacular","genres":["Fantasy","Animation","Drama","Comedy","Science Fiction","Family"],"release_date":"2010-12-07","overview":"Deck the halls with Donkey’s laughter in this all-new holiday collection. Donkey presents his very own carolling stage show featuring his Far Far Away pals in this merry, musical treat with all the trimmings! Join in the fun as they bring their own Shrektacular spirit to festive holiday songs, a fun Donkey Decoration scramble, and a hilarious virtual Yule Log that’s so funny… it’s on fire."},{"movieId":25523,"imgPath":"\/mjdgbl4wv0VlcMuj1jxgjd07bJi.jpg","title":"The Ghost of Lord Farquaad","genres":["Fantasy","Animation","Comedy","Family","Adventure"],"release_date":"2003-05-23","overview":"Lord Farquaad was eaten by the dragon, but his ghost has returned, and he's still evil. With the help of his henchman, Thelonious, he kidnaps Fiona. Shrek and the donkey set out to save her, with help from the dragon, before she goes over a waterfall on a raft."}]