[{"movieId":808,"imgPath":"\/2l5UHZBcp9cx1PwKLdisJ0gV9jB.jpg","title":"Shrek","genres":["Animation","Comedy","Fantasy","Adventure","Family"],"release_date":"2001-05-18","overview":"It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey."},{"movieId":809,"imgPath":"\/l45UqyARB3WxpYNuACjMjndpe85.jpg","title":"Shrek 2","genres":["Animation","Family","Comedy","Fantasy","Adventure"],"release_date":"2004-05-19","overview":"Shrek, Fiona and Donkey set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and the King find it hard to get along, and there's tension in the marriage. The fairy godmother discovers that Shrek has married Fiona instead of her Son Prince Charming and sets about destroying their marriage."},{"movieId":810,"imgPath":"\/lxbKrBo1wZ2U9BS1jiZyNe3qI4J.jpg","title":"Shrek the Third","genres":["Fantasy","Adventure","Animation","Comedy","Family"],"release_date":"2007-05-17","overview":"The King of Far Far Away has died and Shrek and Fiona are to become King & Queen. However, Shrek wants to return to his cozy swamp and live in peace and quiet, so when he finds out there is another heir to the throne, they set off to bring him back to rule the kingdom."},{"movieId":292959,"imgPath":null,"title":"Freak Weather","genres":[],"release_date":"1999-02-02","overview":"In this harrowing character study, Jacqueline McKenzie portrays Penny, a young woman lost in a dangerous abusive relationship. One day, she sets out with her son, supposedly to bring him to school, but instead their day becomes one extended adventure in the extreme netherworlds of sex, drugs, abuse, and criminal behavior."},{"movieId":308642,"imgPath":null,"title":"Field Freak","genres":["Comedy","Horror","Thriller"],"release_date":"2016-05-04","overview":"A family moves into a cabin where they are attacked by the vicious Field Freak."},{"movieId":274794,"imgPath":null,"title":"Freak Out!","genres":["Documentary"],"release_date":"2014-01-25","overview":"Long-haired, barefoot people. Free love! Veganism! Experiments with drugs... The sixties, right? Not quite. In 1900 a group of middle class kids revolted against their time and started the original alternative community - Monte Verità, the mountain of truth. A community based on veganism, feminism, pacifism and free love. This creative documentary mixes interviews, archive and animation in a beautiful combination bringing you straight back to the early 1900 as seen through the eyes of these young radicals. The documentary Freak Out tells the untold story of the birth of the alternative movement and unfold the uncanny similarities between our time and what they revolted against in the early 1900s."}]