[{"movieId":88794,"imgPath":"\/2qM3DsUILkozVy61eN0w7J64GOm.jpg","title":"J. Edgar","genres":["Drama","Crime","History"],"release_date":"2011-11-09","overview":"As the face of law enforcement in the United States for almost 50 years, J. Edgar Hoover was feared and admired, reviled and revered. But behind closed doors, he held secrets that would have destroyed his image, his career, and his life."},{"movieId":413362,"imgPath":"\/w2pGoOHNVESZwlSI3xYk4OdEb91.jpg","title":"Roman J. Israel, Esq.","genres":["Drama","Crime","Thriller"],"release_date":"2017-11-17","overview":"Hard-nosed liberal lawyer Roman J. Israel has been fighting the good fight forever while others take the credit. When his partner – the firm's frontman – has a heart attack, Israel suddenly takes on that role. He soon discovers some unsettling truths about the firm – truths that conflict with his values of helping the poor and dispossessed – and finds himself in an existential crisis that leads to extreme actions."},{"movieId":19585,"imgPath":"\/wDfKY2g0BjdTWVNPewNFkSvRyDH.jpg","title":"G-Force","genres":["Family","Fantasy","Action","Adventure","Comedy"],"release_date":"2009-07-21","overview":"A team of trained secret agent animals, guinea pigs Darwin, Hurley, Juarez, Blaster, mole Speckles, and fly Mooch takes on a mission for the US government to stop evil Leonard Saber, who plans to destroy the world with household appliances. But the government shuts them down and they are sentenced to a pet shop. Can they escape to defeat the villain and save the world?"},{"movieId":794362,"imgPath":"\/zBIwWJUCSFlbFym7XF7TkKO3Tc7.jpg","title":"G-Zombie","genres":["Horror","Fantasy","Comedy"],"release_date":"2021-02-05","overview":"Sara is a research student who wants to make an immunity booster to save humanity. Her experiment however turns people into zombies and in comes Dhruva to save the day."},{"movieId":794362,"imgPath":"\/zBIwWJUCSFlbFym7XF7TkKO3Tc7.jpg","title":"G-Zombie","genres":["Horror","Fantasy","Comedy"],"release_date":"2021-02-05","overview":"Sara is a research student who wants to make an immunity booster to save humanity. Her experiment however turns people into zombies and in comes Dhruva to save the day."},{"movieId":26528,"imgPath":null,"title":"Christmas, Inc.","genres":["Comedy"],"release_date":"2008-12-01","overview":"With Christmas approaching, Santa Claus has to contend with the fact that the North Pole is melting and find a way to rid the holiday of its capitalist nature."},{"movieId":159117,"imgPath":"\/xi3Qh5XoFKA87mJ6xWzjlAap8P7.jpg","title":"V\/H\/S\/2","genres":["Horror","Thriller"],"release_date":"2013-06-06","overview":"Inside a darkened house looms a column of TVs littered with VHS tapes, a pagan shrine to forgotten analog gods. The screens crackle and pop endlessly with monochrome vistas of static white noise permeating the brain and fogging concentration. But you must fight the urge to relax: this is no mere movie night. Those obsolete spools contain more than just magnetic tape. They are imprinted with the very soul of evil."},{"movieId":267806,"imgPath":"\/aFoUjftkOz5sETXfqDSjjXsc1fm.jpg","title":"V\/H\/S: Viral","genres":["Horror","Thriller"],"release_date":"2014-10-23","overview":"V\/H\/S: VIRAL's segments include the story of a deranged illusionist who obtains a magical object of great power; a homemade machine that opens a door to a parallel world; teenage skaters that unwillingly become targets of a Mexican death cult ritual; and a sinister, shadowy organization that is tracking a serial killer. The segments are tied together by the story of a group of fame-obsessed teens following a violent car chase in LA that unwittingly become stars of the next internet sensation."},{"movieId":533642,"imgPath":"\/vHse4QK31Vc3X7BKKU5GOQhYxv6.jpg","title":"Child's Play","genres":["Horror"],"release_date":"2019-06-19","overview":"Karen, a single mother, gifts her son Andy a Buddi doll for his birthday, unaware of its more sinister nature. A contemporary re-imagining of the 1988 horror classic."},{"movieId":9543,"imgPath":"\/iP0capCU4w5nxCDl398CH7yR1r9.jpg","title":"Prince of Persia: The Sands of Time","genres":["Adventure","Fantasy","Action"],"release_date":"2010-05-19","overview":"A rogue prince reluctantly joins forces with a mysterious princess and together, they race against dark forces to safeguard an ancient dagger capable of releasing the Sands of Time – gift from the gods that can reverse time and allow its possessor to rule the world."},{"movieId":808,"imgPath":"\/2l5UHZBcp9cx1PwKLdisJ0gV9jB.jpg","title":"Shrek","genres":["Animation","Comedy","Fantasy","Adventure","Family"],"release_date":"2001-05-18","overview":"It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey."},{"movieId":810,"imgPath":"\/lxbKrBo1wZ2U9BS1jiZyNe3qI4J.jpg","title":"Shrek the Third","genres":["Fantasy","Adventure","Animation","Comedy","Family"],"release_date":"2007-05-17","overview":"The King of Far Far Away has died and Shrek and Fiona are to become King & Queen. However, Shrek wants to return to his cozy swamp and live in peace and quiet, so when he finds out there is another heir to the throne, they set off to bring him back to rule the kingdom."},{"movieId":809,"imgPath":"\/b33E34IywGC4NWYY3G1ck7uehNF.jpg","title":"Shrek 2","genres":["Animation","Family","Comedy","Fantasy","Adventure"],"release_date":"2004-05-19","overview":"Shrek, Fiona and Donkey set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and the King find it hard to get along, and there's tension in the marriage. The fairy godmother discovers that Shrek has married Fiona instead of her Son Prince Charming and sets about destroying their marriage."}]