$(function () {
    // let suras = ["الفاتحة" , "البقرة" , "آل عمران" , "النساء" , "المائدة" , "الأنعام" , "الأعراف" , "الأنفال" , "التوبة" , "يونس" , "هود"  , "يوسف" , "الرعد" , "إبراهيم" , "الحجر" , "النحل" , "الإسراء" , "الكهف" , "مريم" , "طه" , "الأنبياء" , "الحج" , "المؤمنون" , "النور" , "الفرقان" , "الشعراء" , "النمل" , "القصص" , "العنكبوت" , "الروم" , "لقمان" , "السجدة" , "الأحزاب" , "سبأ" , "فاطر" , "يس" , "الصافات" , "ص" , "الزمر" , "غافر" , "فصلت" , "الشورى" , "الزخرف" , "الدخان" , "الجاثية" , "الأحقاف" , "محمد"  , "الفتح" , "الحجرات" , "ق" , "الذاريات" , "الطور" , "النجم" , "القمر" , "الرحمن" , "الواقعة" , "الحديد" , "المجادلة" , "الحشر"  , "الممتحنة" , "الصف" , "الجمعة" , "المنافقون" , "التغابن" , "الطلاق"  , "التحريم" , "الملك" , "القلم" , "الحاقة" , "المعارج" , "نوح" , "الجن" , "المزمل" , "المدثر" , "القيامة" , "الإنسان" , "المرسلات" , "النبأ" , "النازعات" , "عبس" , "التكوير" , "الانفطار" , "المطففين" , "الانشقاق" , "البروج" , "الطارق" , "الأعلى" , "الغاشية" , "الفجر" , "البلد" , "الشمس" , "الليل" , "الضحى" , "الشرح" , "التين" , "العلق" , "القدر" , "البينة" , "الزلزلة" , "العاديات" , "القارعة" , "التكاثر" , "العصر" , "الهُمزة" , "الفيل" , "قريش" , "الماعون" , "الكوثر" , "الكافرون" , "النصر" , "المسد" , "الإخلاص" , "الفلق" , "الناس"]

    // for (let i = 0; i <= 113; i++) {
    //     $("#sura-num").append(`<option value="${i+1}">${suras[i]}</option>`);

    // }
    getSura(1, "الفاتحة");
    $('#sura-num').change(function (e) {
        getSura(this.value, $(this).find(":selected").text());
    });
});

function getSura(suraNum, title) {
    $.ajax({
        type: "GET",
        url: `https://quranenc.com/api/v1/translation/sura/english_saheeh/${suraNum}`,
        dataType: "json",
        success: function (response) {
            appendToHTML(response, title);
        }
    });
}

function appendToHTML(response, title) {

    console.log(response, title)
    $("#container #title").html(title);
    $("#container p").html(``);
    for (const key in response.result) {
        $("#container p").append(`<span class='aya'>${response.result[key]['arabic_text']} <span class='aya-num'>${response.result[key]['aya']}</span></span>`);
    }
}

